In [1]:
import pandas as pd

# Create DataFrame

In [14]:
data = {
    "nama" : ["Ali", "Jerry", "Mukhlis", "Devina", "Rizky", "Asep", "April", "Ridwan", "Alif", "Helmi",
              "Joseph", "Rinaldy", "Akbar", "Anies", "Yusuf", "Aldy", "Aldrian", "Giordy", "Jamal", "Supri"],
    "usia" : [23, 24, 45, 23, 54, 34, 24, 56, 34, 25, 21, 20, 26, 34, 27, 34, 36, 21, 34, 37],
    "kota" : ["Jakarta", "Bandung", "Medan", "Padang", "Merauke", "Pontianak", "Sumedang", "Ambon", "Lampung", "Garut",
              "Riau", "Palembang", "Aceh", "Subang", "Cirebon", "Depok", "Bogor", "Pangkal Pinang", "Bangka Belitung", "Balikpapan" ]
            
        }

In [15]:
df = pd.DataFrame(data) #making DataFrame
print(df)

       nama  usia             kota
0       Ali    23          Jakarta
1     Jerry    24          Bandung
2   Mukhlis    45            Medan
3    Devina    23           Padang
4     Rizky    54          Merauke
5      Asep    34        Pontianak
6     April    24         Sumedang
7    Ridwan    56            Ambon
8      Alif    34          Lampung
9     Helmi    25            Garut
10   Joseph    21             Riau
11  Rinaldy    20        Palembang
12    Akbar    26             Aceh
13    Anies    34           Subang
14    Yusuf    27          Cirebon
15     Aldy    34            Depok
16  Aldrian    36            Bogor
17   Giordy    21   Pangkal Pinang
18    Jamal    34  Bangka Belitung
19    Supri    37       Balikpapan

# Show the first five rows in 'data'

In [17]:
df.loc[0:4] #showing the first five rows

      nama  usia     kota
0      Ali    23  Jakarta
1    Jerry    24  Bandung
2  Mukhlis    45    Medan
3   Devina    23   Padang
4    Rizky    54  Merauke

# added new column 'gender', 'alamat', 'pekerjaan' in DataFrame 'data'

In [18]:
df["gender"] = ["Male", "Male", "Male", "Female", "Male", "Male", "Female", "Male", "Male", "Male",
                "Male", "Male", "Male", "Female", "Male", "Male", "Male", "Male", "Male", "Male"]
df["alamat"] = ["Jl. Merdeka No. 10", "Jl. Bahagia No. 5", "Jl. Jendral Sudirman No. 20", "Jl. Cinta No. 15", "Jl. Harmoni No. 30",
                "Jl. Kenangan No. 25", "Jl. Indah No. 12", "Jl. Makmur No. 18", "Jl. Sejahtera No. 8", "Jl. Puncak No. 11",
                "Jl. Damai No. 22", "Jl. Berkah No. 35", "Jl. Berkat No. 16", "Jl. Kasih No. 29", "Jl. Kesejahteraan No. 14",
                "Jl. Ceria No. 9", "Jl. Bahagia No. 7", "Jl. Makmur No. 2", "Jl. Jaya No. 40", "Jl. Kebahagiaan No. 33"]
df["pekerjaan"] = ["Engineer", "Teacher", "Doctor", "Designer", "Manager", "Programmer", "Nurse", "CEO", "Artist", "Entrepreneur",
                   "Analyst", "Architect", "Engineer", "Artist", "Accountant", "Doctor", "Manager", "Engineer", "Artist", "Entrepreneur"]

In [19]:
df.head()

      nama  usia     kota  gender                       alamat pekerjaan
0      Ali    23  Jakarta    Male           Jl. Merdeka No. 10  Engineer
1    Jerry    24  Bandung    Male            Jl. Bahagia No. 5   Teacher
2  Mukhlis    45    Medan    Male  Jl. Jendral Sudirman No. 20    Doctor
3   Devina    23   Padang  Female             Jl. Cinta No. 15  Designer
4    Rizky    54  Merauke    Male           Jl. Harmoni No. 30   Manager

# Filter 'usia' > 25

In [9]:
select = df.query("usia > 25").copy()
select

,nama,usia,kota,gender,alamat,pekerjaan
2,Mukhlis,45,Medan,Male,Jl. Jendral Sudirman No. 20,Doctor
4,Rizky,54,Merauke,Male,Jl. Harmoni No. 30,Manager
5,Asep,34,Pontianak,Male,Jl. Kenangan No. 25,Programmer
7,Ridwan,56,Ambon,Male,Jl. Makmur No. 18,CEO
8,Alif,34,Lampung,Male,Jl. Sejahtera No. 8,Artist
12,Akbar,26,Aceh,Male,Jl. Berkat No. 16,Engineer
13,Anies,34,Subang,Female,Jl. Kasih No. 29,Artist
14,Yusuf,27,Cirebon,Male,Jl. Kesejahteraan No. 14,Accountant
15,Aldy,34,Depok,Male,Jl. Ceria No. 9,Doctor
16,Aldrian,36,Bogor,Male,Jl. Bahagia No. 7,Manager
18,Jamal,34,Bangka Belitung,Male,Jl. Jaya No. 40,Artist
19,Supri,37,Balikpapan,Male,Jl. Kebahagiaan No. 33,Entrepreneur

# Filter 'data' usia > 30 and Gender == Female

In [10]:
select = df[(df['usia'] > 30) & (df['gender'] == "Female")]
select

     nama  usia    kota  gender            alamat pekerjaan
13  Anies    34  Subang  Female  Jl. Kasih No. 29    Artist

# using .loc[] and .iloc[] to access row 3 and 4

In [11]:
df.loc[2:3]

      nama  usia    kota  gender                       alamat pekerjaan
2  Mukhlis    45   Medan    Male  Jl. Jendral Sudirman No. 20    Doctor
3   Devina    23  Padang  Female             Jl. Cinta No. 15  Designer

In [12]:
df.iloc[2:4]

      nama  usia    kota  gender                       alamat pekerjaan
2  Mukhlis    45   Medan    Male  Jl. Jendral Sudirman No. 20    Doctor
3   Devina    23  Padang  Female             Jl. Cinta No. 15  Designer

# Sum average of 'usia' form DataFrame 'data'

In [13]:
average_usia = df["usia"].mean()
average_usia

31.6

# Export DataFrame 'data' to .csv

In [20]:
df.to_csv(path_or_buf="./data.csv", index=False)